Revit 2027 API
IFCOpeningDimensions Class
 Contains calculated dimensions for an IFC opening element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCOpeningDimensions
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCOpeningDimensions : IDisposable
Public Class IFCOpeningDimensions
	Implements IDisposable
public ref class IFCOpeningDimensions : IDisposable
type IFCOpeningDimensions =
    class
        interface IDisposable
    end
The IFCOpeningDimensions type exposes the following members.
Constructors
Name | Description
IFCOpeningDimensions() |  Creates default opening dimensions with zero values.
IFCOpeningDimensions(IFCAnyHandle) |  Creates opening dimensions with a specified handle. The opening handle.
Top
Properties
Name | Description
Area |  The area of the opening.
Depth |  The depth of the opening.
HasRectangularDimensions |  True if width and height are valid, false if only area is valid.
Height |  The height of the opening.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Width |  The width of the opening.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCOpeningDimensions
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetOpeningHandle |  Gets the IFC opening element handle.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace